numediart/iFCH-devices/iFCH_logger/firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c6"

# For Arduino
CONFIG_FREERTOS_HZ=1000
CONFIG_AUTOSTART_ARDUINO=y
CONFIG_ARDUINO_VARIANT="sparkfun_esp32c6_thing_plus"

# For Serial
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

CONFIG_BT_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=n
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_EXT_ADV=y
CONFIG_BT_NIMBLE_50_FEATURE_SUPPORT=y
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=161
CONFIG_BT_NIMBLE_SVC_GAP_PPCP_MAX_CONN_INTERVAL=12
CONFIG_BT_NIMBLE_SVC_GAP_PPCP_MIN_CONN_INTERVAL=12
CONFIG_BT_NIMBLE_SVC_GAP_PPCP_SLAVE_LATENCY=2
CONFIG_BT_NIMBLE_SVC_GAP_PPCP_SUPERVISION_TMO=400

CONFIG_COMPILER_OPTIMIZATION_SIZE=y
